app/Models/M_sekolah.php

    public function getTP($id_user, $id_mapel, $kelas, $tahun_ajaran)
    {
        $getdata = $this->db->table('tb_tujuan_pembelajaran')->where(['id_guru' => $id_user, 'id_mapel' => $id_mapel, 'kelas' => $kelas, 'tahun_ajaran' => $tahun_ajaran])->get();
---
SELECT *
FROM `tb_tujuan_pembelajaran`
WHERE `id_guru` = '279'
AND `id_mapel` = '291'
AND `kelas` = '10'
AND `tahun_ajaran` = 2023